Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྙིང་རྗེ་ལྡན་པ་བསོད་ནམས་དག་ལ་ཡིད་དགའ་ལོངས།
en: The Bhagavat said: “ ‘Arise, compassionate one who rejoices in merit.

source: །ཕྱོགས་བཅུའི་སྐུ་མཆོག་མངའ་བ་རྣམས་ཀྱིས་ལུང་བསྟན་ཏེ།
en: Those with supreme bodies in the ten directions have given their prophecy.

source: །ཞིང་དང་བཅས་པའི་ས་ཡང་རྣམ་དྲུག་རབ་ཏུ་གཡོས།
en: The earth and its ground shook intensely in six ways.

source: །རྒྱལ་བ་གང་ཟག་གཙོ་བོ་དྲང་སྲོང་ཆེན་པོར་འགྱུར།
en: You will become a jina, a supreme individual, a great ṛṣi.’ “

source: །དེ་ནས་རྒྱལ་པོའི་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་གཉིས་པ་མུ་ཁྱུད་ཅེས་བྱ་བ་ལ་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཀྱང་དེ་བཞིན་དུ་ཡོངས་སུ་གཏོང་བ་ཆེན་པོ་འདི་ལ་རྗེས་སུ་ཡི་རང་བར་གྱིས་ཤིག །
en: Then the brahmin Samudrareṇu, the chief court priest, summoned the second prince, who was named Nimi, and said to him, ‘Noble son, you should in the same way rejoice in this great act of generosity.

source: ཁྱོད་ཀྱིས་དགེ་བ་ཉེ་བར་བསྒྲུབས་པ་གང་ཡིན་པ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག །
en: You should dedicate the good actions that you have accomplished toward omniscience for the sake of all beings and develop the motivation to attain the highest, most complete enlightenment.’ “

source: དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་མུ་ཁྱུད་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དཔག་ཏུ་མ་མཆིས་པ་དང་བཅས་པ་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བགྱིས་པ་གང་ལགས་པ་དང་།
en: Then Prince Nimi sat before the Bhagavat and said, ‘Bhagavat, I have served with all offerings the Bhagavat and his immeasurable saṅgha of bhikṣus.

source: རྗེས་སུ་ཡི་རང་བ་ལས་བྱུང་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དང་། ལུས་དང་ངག་དང་ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བགྱི་སྟེ།
en: The aggregate of merit that comes from rejoicing in having done this, and whatever aggregate of merit there is from the good activity of my body, speech, and mind, I dedicate it all to the highest, most complete enlightenment.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་འདི་འབའ་ཞིག་ཏུ་བདག་གིས་བྱང་ཆུབ་ལ་རེག་པར་མི་བགྱི་བར།
en: May I not reach enlightenment in this afflicted buddha realm.

source: གཞོན་ནུ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་ཐམས་ཅད་ཡང་དག་པར་བསགས་པ་ཞེས་བགྱི་བ་དེར་བྱང་ཆུབ་ཀྱི་ཤིང་རིན་པོ་ཆེ་དུ་མས་བཀོད་པའི་དྲུང་དུ་མཆིས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་།
en: Prince Avalokiteśvara will attain the complete enlightenment of perfect buddhahood in the realm Sarvaratnasaṃnicaya while seated under a Bodhi tree that is adorned with an array of many jewels and will become the Tathāgata Saman­taraśmya­bhyudgataśrīkūṭa­rāja.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཀུན་ནས་འཕགས་པ་དཔལ་བརྩེགས་རྒྱལ་པོ་ཞེས་བགྱི་བར་འགྱུར་བ་ཆོས་འཆད་པར་བགྱི་བའི་སླད་དུ་བདག་གིས་དེ་ལ་གསོལ་བ་གདབ་པར་བགྱི་ཞིང་།
en: I shall request him to teach the Dharma.

source: ཇི་སྲིད་དུ་དེ་བཞིན་གཤེགས་པ་དེ་ཆོས་སྟོན་པར་མཛད་པ་དེ་སྲིད་དུ་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: I will practice the conduct of a bodhisattva for as long as that tathāgata teaches the Dharma.

source: །དེ་བཞིན་གཤེགས་པ་དེ་འདས་ཤིང་དམ་པའི་ཆོས་ནུབ་པ་ན་དེའི་འོག་ཏུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་།
en: When that tathāgata has passed away and his Dharma has ceased to exist, I will attain the complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཀུན་ནས་འཕགས་པ་དཔལ་བརྩེགས་རྒྱལ་པོའི་ཡོན་ཏན་བཀོད་པ་ཐམས་ཅད་ཇི་ལྟ་བར་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡང་དེ་ལྟ་བུར་གྱུར་ཅིག །
en: My buddha realm will have an array of qualities that will be the same as the entire array of qualities of the Tathāgata Saman­taraśmya­bhyudgataśrīkūṭa­rāja’s realm.

source: དེ་བཞིན་དུ་བདག་ཀྱང་སངས་རྒྱས་ཀྱི་མཛད་པ་བགྱིད་པར་འགྱུར་ཞིང་དེ་བཞིན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བགྱིའོ།
en: I will accomplish the deeds of a buddha in the same way, and in the same way I will pass into parinirvāṇa.

source: །ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དེ་བཞིན་དུ་དམ་པའི་ཆོས་ཀྱང་ཡུན་རིང་དུ་གནས་པར་གྱུར་ཅིག །
en: After I have passed into nirvāṇa may the Dharma remain for a long time.’ “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ནི་གནས་པ་ཆེན་པོ་དོན་དུ་གཉེར་ཏེ།
en: The Bhagavat said, ‘Noble son, you wish to attain great power.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཇི་ལྟར་རང་གིས་ཡོངས་སུ་བཟུང་བ་དེ་ལྟ་བུའི་གནས་འཐོབ་པར་འགྱུར་རོ།
en: Noble son, you will attain the same power that I have attained.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་ཏེ།
en: Noble son, in that buddha realm you will attain the complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་རབ་དུ་བརྟན་པ་ཡོན་ཏན་ནོར་བུ་བརྩེགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: You will be the tathāgata named Supra­tiṣṭhita­guṇa­maṇikūṭa­rāja.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་གནས་ཆེན་པོ་ཡོངས་སུ་བཟུང་བ་དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་མཐུ་ཆེན་ཐོབ་ཅེས་བྱ་བར་གྱུར་ཅིག །
en: Noble son, you will obtain that great power and therefore, noble son, may you become Mahāsthāmaprāpta.’ “

source: དེས་གསོལ་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་གང་གི་ཚེ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ལུས་ཀྱི་ཡན་ལག་ལྔས་ཕྱག་འཚལ་བ་དེའི་ཚེ། ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གིས་བདག་ལ་ལུང་སྟོན་པར་མཛད་ཅིང་། སྣ་མའི་མེ་ཏོག་གི་ཆར་ཡང་རབ་ཏུ་འབབ་པར་གྱུར་ཅིག །
en: He said, ‘Bhagavat, if these wishes of mine are to be fulfilled, for that reason, when I bow down the five parts of my body to the Bhagavat’s feet, may the bhagavat buddhas in the ten directions, as numerous as the grains of sand in the Ganges River, give me their prophecy, and may there be a rain of jasmine flowers.’ “

source: རིགས་ཀྱི་བུ་གང་གི་ཚེ་སྐྱེས་བུ་དམ་པ་མཐུ་ཆེན་ཐོབ་ཀྱིས། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་པ་དེའི་ཚེ། ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱིས་ལུང་བསྟན་ཅིང་ས་ཆེན་པོ་ཡང་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་སྣ་མའི་མེ་ཏོག་གི་ཆར་ཡང་བབ་པར་གྱུར་པ་དང་།
en: Noble son, when that worthy being, Mahāsthāmaprāpta, bowed down the five parts of his body to the feet of the Tathāgata Ratnagarbha, the bhagavat buddhas in the ten directions, as numerous as the grains of sand in the Ganges River, gave their prophecy. The great earth shook in six ways, and there was a rain of jasmine flowers. “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བསོད་ནམས་མཐུ་ཤུགས་བརྟན་པར་གྱུར་པ་ལོངས།
en: The Bhagavat said: “ ‘Arise, you whose meritorious actions have the force of unwavering power.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་མགོན་པོས་ལུང་བསྟན་ཏེ།
en: You have received a prophecy from the world guardians in the ten directions.

source: །ས་ཆེན་གཡོས་ཤིང་སྣ་མའི་ཆར་ཡང་བབ།
en: The great earth shook, and a rain of jasmine flowers fell.

source: །ཁྱོད་ནི་ལྷ་ཡི་ཚངས་པ་ལྟ་བུར་འགྱུར།
en: You will become like Brahmā among the devas.’ “

source: །དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། རྒྱལ་བུ་གསུམ་པ་དབང་པོའི་ཚོགས་ཞེས་བྱ་བ་ལ་སྨྲས་པ་དང་།
en: Then the brahmin Samudrareṇu summoned the third prince, who was named Indragaṇa, and spoke to him as he had to the others. “

source: ཐལ་མོ་སྦྱར་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བགྱིས་པ་གང་ལགས་པ་དང་། བདག་གི་ལུས་དང་ངག་དང་ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པ་གང་ལགས་པ་དང་། རྗེས་སུ་ཡི་རང་བ་འདི་དང་ལྡན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ།
en: Prince Indragaṇa, with palms together, said to the Tathāgata Ratnagarbha, ‘Bhagavat, the entire aggregate of merit that comes from rejoicing in having served with all offerings the Bhagavat and his saṅgha of bhikṣus, and the good activity of my body, speech, and mind, I dedicate to the highest, most complete enlightenment. “ ‘

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་དུ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱི་ཞིང་ཤིན་ཏུ་མྱུར་བར་ཐོབ་པར་ཡང་མི་བགྱི་ལགས་སོ།
en: May I not attain the complete enlightenment of perfect buddhahood in an afflicted buddha realm, and may I not attain it quickly.

source: །ཇི་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་པ་དེ་སྲིད་དུ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་ཅིང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་གཞན་དང་གཞན་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཐོང་བར་གྱུར་ཅིག །
en: While I am performing bodhisattva conduct, until I attain the complete enlightenment of perfect buddhahood, may I see the bhagavat buddhas in other endless, infinite realms in the ten directions.

source: བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་གང་དག་བདག་གིས་དང་པོར་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་པ་དང་། བདག་གིས་གང་དག་དེར་དང་པོར་བྱང་ཆུབ་མཆོག་ཏུ་སེམས་བསྐྱེད་དེ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་རབ་ཏུ་བཀོད་པ་དང་། གང་དག་བདག་གིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཡང་དག་པར་འཛིན་དུ་སྩལ་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བདག་གིས་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་པ་དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ན་ཆོས་སྟོན་པར་མཛད་པ་རྣམས་ཀྱང་བདག་གི་ལྷའི་མིག་གིས་མཐོང་བར་གྱུར་ཅིག །
en: May I see with divine sight, in buddha realms as numerous as the particles in buddha realms as numerous as the grains of sand in the Ganges River, bhagavat buddhas teaching the Dharma whom I first caused to acquire, enter, and remain in the aspiration for enlightenment, and whom I caused to acquire, enter, and remain in the practice of the perfections and the conduct of a bodhisattva. “ ‘

source: བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དེ་ལྟར་སངས་རྒྱས་ཀྱི་མཛད་པ་བགྱིད་ཅིང་།
en: While I thus perform bodhisattva conduct, may I accomplish the deeds of a buddha.

source: ཇི་སྲིད་དུ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སེམས་ཅན་གང་དག་སྐྱེ་བར་འགྱུར་བ་དེ་དག་འདི་ལྟ་སྟེ་དཔེར་བགྱི་ན་ཚངས་རིས་ཀྱི་ལྷ་རྣམས་ལྟ་བུར་འགྱུར་བ་དེ་སྲིད་དུ་བདག་གིས་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཡོངས་སུ་སྦྱོང་བར་བགྱི་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: While I am performing bodhisattva conduct may I purify the motivations of beings so that those beings who will be born in my buddha realm will be, for example, like Brahmā devas.

source: །ཅི་ནས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ཏུ་འགྱུར་བ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡོངས་སུ་སྦྱང་བར་བགྱི་སྟེ།
en: May I purify an array of buddha-realm qualities so that it will be as if as many billion-world universes as there are grains of sand in the Ganges River have become one buddha realm.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེའི་ར་བ་དག་ཀྱང་སྲིད་པའི་རྩེ་མོའི་མཐར་ཐུག་ཅིང་རིན་པོ་ཆེ་དུ་མ་ཀུན་ནས་གནས་པ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་དག་གིས་སྤྲས་པར་གྱུར་ཅིག །
en: May that buddha realm’s surrounding walls, which reach as high as the summit of existence, be made of many jewels, and be adorned with a variety of jewels.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེའི་ས་གཞི་ཐམས་ཅད་ནི་བཻ་དཱུརྱ་འབའ་ཞིག་ལས་བགྱིས་པར་གྱུར་ཅིང་རྡུལ་དང་། གོར་མ་དང་། གསེག་མ་མ་མཆིས་ཤིང་ས་གཞི་རྙོག་པ་དང་འདྲེས་པ་མ་མཆིས་པར་གྱུར་ཅིག །
en: May the entire ground in that buddha realm be made of beryl; may there be no dust, stones, or gravel; and may it be free of any dirt. “ ‘

source: དེ་ན་བུད་མེད་ནི་མིང་དུ་གདགས་པ་ཡང་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there not be even the word woman.

source: སེམས་ཅན་ཐམས་ཅད་ནི་རྫུས་ཏེ་སྐྱེ་པར་གྱུར་ཅིག །
en: May the beings there be born spontaneously.

source: དེ་ན་སེམས་ཅན་རྣམས་ཟས་ཁམ་གྱིས་འཚལ་བ་མ་མཆིས་པར་གྱུར་ཅིག །
en: May the beings there have no wish for nourishment through mouthfuls of food.

source: དེ་ན་སེམས་ཅན་ཐམས་ཅད་དགའ་བའི་ཟས་དང་ཆོས་ཀྱི་ཟས་དང་ལྡན་པར་གྱུར་ཅིག །
en: May the beings there be nourished by joy and nourished by the Dharma.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ནི་གདགས་སུ་ཡང་མ་མཆིས་པར་གྱུར་ཅིག །
en: In that buddha realm may there not be the words śrāvaka or pratyekabuddha.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཐ་བ་དང་། དྲི་མ་དང་། ཞེ་སྡང་དང་། འཆབ་པ་དང་བྲལ་ཞིང་ཚངས་པར་སྤྱོད་པ་ཡོངས་སུ་དག་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་གིས་ཡོངས་སུ་གང་བར་གྱུར་ཅིག །
en: May that buddha realm be filled only with bodhisattvas who are free of obduracy, stains, anger, and hypocrisy, and who remain in pure celibacy.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་སྐྲ་བྲེགས་ཤིང་ཆོས་གོས་ངུར་སྨྲིག་འཚལ་བ་ཤ་སྟག་འབྱུང་བར་གྱུར་ཅིག །
en: May all the bodhisattvas there have shaved heads and wear saffron-colored robes. “ ‘

source: སྐྱེས་མ་ཐག་ཏུ་འོད་ཆེན་པོ་དང་ལྡན་པར་གྱུར་ཅིག །
en: As soon as they are born there, may they have great auras of light.

source: དེ་དག་གི་སུག་པར་རིན་པོ་ཆེའི་ལྷུང་བཟེད་རོ་བྲོ་བ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གཏམས་པ་དག་འབྱུང་བར་གྱུར་ཅིག །
en: May there appear in their hands precious alms bowls filled with various flavors.

source: བྱུང་མ་ཐག་ཏུ་འདི་སྙམ་དུ་གང་བདག་ཅག་ཟས་ཁམ་གྱིས་ཟ་བ་ནི་བདག་ཅག་གི་ཆ་མ་ཡིན་གྱིས།
en: As soon as those appear, may they think, “This food we have is not for us.

source: གང་བདག་ཅག་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ཏུ་དོང་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དག་ལ་ཞལ་ཟས་འདི་དབུལ་བར་བྱའོ།
en: We should go to other worlds and offer this food to the bhagavat buddhas who reside, live, and remain there.

source: །སངས་རྒྱས་ཀྱི་ཉན་ཐོས་རྣམས་དང་། སྐྱེ་བོ་སྡུག་བསྔལ་བ་རྣམས་ལ་ཡང་སྦྱིན་པར་བྱའོ།
en: We should also give it to the buddhas’ śrāvakas and to beings in suffering.

source: །ཡི་དགས་ཀྱི་གནས་རྣམས་སུ་སོང་ལ་བཀྲེས་པ་དང་། སྐོམ་པས་ལུས་རབ་ཏུ་འབར་བའི་སེམས་ཅན་རྣམས་ལ་ཡང་ཟས་འདི་སྦྱིན་པར་བྱའོ་སྙམ་པའི་དྲན་པ་ཐོབ་པར་གྱུར་ཅིག །
en: We should also go to the realm of the pretas and give this food to the beings there whose bodies are aflame with hunger and thirst.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་དེ་ལྟར་སེམས་བསྐྱེད་མ་ཐག་ཏུ་བསམ་གྱིས་མི་ཁྱབ་པའི་སྤྱོད་པ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །
en: As soon as those bodhisattva mahāsattvas have that aspiration, may they obtain the samādhi called inconceivable activity.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ནས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་གཞན་དག་ཏུ་ཐོགས་པ་མ་མཆིས་པར་མཆི་བར་འགྱུར་ཞིང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དག་དང་ཉན་ཐོས་དང་། སེམས་ཅན་གཞན་དག་ལ་ཡང་ཞལ་ཟས་འབུལ་བར་གྱུར་ཅིག །
en: When they have attained that samādhi, may they go without any hindrance to the countless, innumerable buddha realms in the ten directions, and offer the food to the bhagavat buddhas who reside, live, and remain there and to the śrāvakas and to other beings.

source: དགའ་བས་ཕུལ་ནས་ཀྱང་ཆོས་བཤད་པར་བགྱིས་ནས་དེ་ཉིད་ཀྱི་སྔ་དྲོས་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སླར་མཆི་བར་གྱུར་ཅིག །
en: May they offer the food with joy, teach the Dharma, and that same morning return to their own buddha realm. “ ‘

source: གོས་རིན་པོ་ཆེ་དག་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་ཏེ། དེ་ཉིད་ཀྱི་སྔ་དྲོའི་བར་གྱིས་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སླར་མཆིས་ནས་གཅིག་ལ་གཅིག་གོས་དག་སྐོན་པར་ཡང་གྱུར་ཅིག །
en: May it be the same for the offering of precious clothing, up to their return that same morning to their own buddha realm where they dress each other in monastic robes. “ ‘

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ལོངས་སྤྱོད་དང་ཡོངས་སུ་སྤྱད་པ་གང་ཇི་སྙེད་མཆིས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། ཉན་ཐོས་རྣམས་དང་། སེམས་ཅན་གཞན་དག་དང་ཐུན་མོང་དུ་བགྱིས་ནས་སླད་ཀྱིས་བདག་ཡོངས་སུ་སྤྱོད་པར་གྱུར་ཅིག །
en: May the bodhisattvas first share all the pleasures and enjoyments they find in that buddha realm with the bhagavat buddhas, the śrāvakas, and other beings, and only afterward enjoy them themselves.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་མི་ཁོམ་པ་བརྒྱད་དང་བྲལ་བར་གྱུར་ཅིག །
en: May that buddha realm be free of the eight unfavorable states.

source: དེ་ན་སྡུག་བསྔལ་གྱི་སྒྲ་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there not be the word suffering there.

source: བསླབ་པ་བླང་བའི་སྒྲ་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there not be the word training there.

source: ལྟུང་བྱེད་ལས་བསླང་བའི་སྒྲ་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there not be the word transgression there. “ ‘

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་རིན་པོ་ཆེ་འབུམ་ཕྲག་དུ་མ་དག་བསགས་པར་གྱུར་ཅིག །
en: May there be an accumulation of hundreds of thousands of jewels in that buddha realm.

source: རིན་པོ་ཆེ་དུ་མས་སྤྲས་ཤིང་ནོར་བུ་ལྟར་ཀུན་ཏུ་སྣང་བར་གྱུར་ཅིག །
en: May it be beautified by jewels and appear to be made of jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་གང་དག་ཕྱོགས་བཅུ་རྣམས་སུ་སྔོན་མ་མཐོང་བ་དང་། སྔོན་མ་ཐོས་པའི་ནོར་བུ་རིན་པོ་ཆེ་དེ་དག་སྤྱོད་པར་གྱུར་ཅིག །ནོར་བུ་རིན་པོ་ཆེ་དེ་དག་གི་མིང་བརྗོད་ན་ལོ་བྱེ་བས་ཀྱང་མི་བས་པར་གྱུར་ཅིག །
en: May there be present there all the jewels in the ten directions that have never been seen before and never been heard of before, and whose names would take ten million years to recite.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་གསེར་ལས་གྲུབ་པར་མཐོང་བར་འཚལ་ན་ཡང་དེ་ལ་གསེར་ལས་གྲུབ་པར་གནས་པར་འགྱུར་བ་དང་། གང་དངུལ་ལས་གྲུབ་པར་འཚལ་བ་དེས་དངུལ་ལས་གྲུབ་པར་མཐོང་ཡང་དེ་ལ་གསེར་ལས་གྲུབ་པ་ཡང་ཉམས་པར་མི་འགྱུར་བ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: May a bodhisattva see the buddha realm as being made of gold if he wishes it to be made of gold, and may it continue to be made of gold for him; may another bodhisattva see it as being made of silver if he wishes it to be made of silver, without causing the realm made of gold to vanish.

source: གང་ཤེལ་ལས་གྲུབ་པ་དང་། བཻ་དཱུརྱ་ལས་གྲུབ་པ་དང་། རྡོའི་སྙིང་པོ་ལས་གྲུབ་པ་དང་། མུ་ཏིག་དམར་པོ་ལས་གྲུབ་པ་དང་། སྤུག་ལས་གྲུབ་པར་འཚལ་ན་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་རིན་པོ་ཆེ་རྣམ་པ་དེ་ལྟ་བུ་དག་ཏུ་མཐོང་བར་གྱུར་ཅིག །
en: In the same way, may a bodhisattva see the realm as being made of crystal, or made of beryl, or made of emerald, or made of red pearls, or made of white coral, or made of whatever precious material he wishes. “ ‘

source: བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཨ་ག་རུ་ལས་གྲུབ་པ་དང་། རྒྱ་སྤོས་ལས་གྲུབ་པ་དང་། ཏ་མ་ལའི་ལོ་མ་ལས་གྲུབ་པ་དང་། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་ལས་གྲུབ་པ་དང་། ཙན་དན་ས་མཆོག་པ་ལས་གྲུབ་པར་མཐོང་བར་འཚལ་ན་ཡང་དེ་ལ་དེ་བཞིན་དུ་གྱུར་ཅིག །
en: May a bodhisattva see the buddha realm as being made of agarwood, made of tagar leaves, made of bay leaves, made of gośīrṣa sandalwood, or made of uragasāra sandalwood, just as he wishes.

source: ཇི་ལྟ་ཇི་ལྟར་ཅི་འདྲ་བར་མཐོང་བར་འཚལ་བ་དེ་ལྟ་དེ་ལྟར་དེ་དང་འདྲ་བར་མཐོང་བར་གྱུར་ཅིག །གཅིག་གིས་གཉིས་པའི་སྨོན་ལམ་མཐོང་བར་མི་འགྱུར་ཞིང་། ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ཡང་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: May he see it as being exactly how he wishes, without one seeing what another aspires for, but with everyone’s aspirations fulfilled. “ ‘

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཉི་མ་དང་ཟླ་བར་མངོན་པ་ཡང་མ་མཆིས་ཤིང་། དེར་བྱང་ཆུབ་སེམས་དཔའ་འོད་ཅན་དག་སྐྱེ་བར་གྱུར་ཅིག །
en: May there be no sun or moon in that buddha realm, but may the bodhisattvas born there emit their own light.

source: གཞན་ཡང་འོད་ཇི་ལྟ་བུ་དག་འཚལ་བ་དེ་ལྟ་བུ་དག་ཐ་ན་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཚུན་ཆད་དུ་ཡང་གཏོང་བར་གྱུར་ཅིག །
en: May there be whatever kind of light is wished for even to the extent of reaching a hundred thousand million trillion buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་མེ་ཏོག་ཁ་བྱེ་བ་མ་གཏོགས་པར་མཚན་མོ་དང་། ཉིན་མོ་དག་མིང་ཡང་མ་མཆིས་པར་གྱུར་ཅིག །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བ་དེ་དགའ་ལྡན་དག་ཏུ་ཚེ་བས་པར་བགྱིས་ནས་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ཏུ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་མ་གཏོགས་པར་གྲང་བ་དང་།
en: Other than the opening of the flowers, may there not even be the words night and day in that buddha realm.

source: ཚ་བ་དང་། ནད་དང་། མི་བདེ་བ་དང་། རྒ་བ་དང་། འགུམ་པ་ཡང་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there be no heat, cold, illness, weakness, old age, or death in that buddha realm. If a bodhisattva wishes to attain the complete enlightenment of perfect buddhahood, may he go to a Tuṣita paradise, end his life there, and then attain the complete enlightenment of perfect buddhahood in another world. “ ‘

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་འགུམ་པ་མ་མཆིས་པར་འགྱུར་ཞིང་སྟེང་གི་བར་སྣང་ལ་དེ་བཞིན་གཤེགས་པ་ལྟར་བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གྱུར་ཅིག །
en: May there be no death in that buddha realm. May the Tathāgata’s parinirvāṇa take place high in the sky when he attains the ultimate nirvāṇa.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱོད་པ་ཇི་ལྟ་བུ་དག་འཚལ་བ་དེ་ལྟ་བུ་དག་མངོན་པར་འགྲུབ་པར་གྱུར་ཅིག །
en: May whatever enjoyment or pleasure a bodhisattva wishes for occur.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ཏུ་ནམ་མཁའི་དཀྱིལ་ནས་སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་སྒྲ་འཁྲོལ་བར་གྱུར་ཅིག །སིལ་སྙན་དེ་དག་ལས་ཀྱང་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱི་སྒྲ་འབྱུང་བ་དང་། སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་།
en: May there come from the middle of the sky the sound of many hundreds of thousands of millions of trillions of musical instruments throughout the buddha realm.

source: དགེ་འདུན་གྱི་སྒྲ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་སྒྲ་འབྱུང་བར་འགྱུར་བ་དང་།
en: May there be no words of desire within that music, but the words perfections, Buddha, Dharma, Saṅgha, and Dharma teachings from the bodhisattva piṭaka.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཇི་ལྟར་མོས་པ་དེ་ལྟ་བུའི་སྒྲ་ཐོས་པར་འགྱུར་བ་མ་གཏོགས་པར་འདོད་པ་དང་ལྡན་པའི་སྒྲ་དག་མི་འབྱུང་བར་གྱུར་ཅིག །
en: May the bodhisattvas hear the words that they wish to hear. “ ‘

source: བཅོམ་ལྡན་འདས་བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་གིས་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཇི་སྙེད་མཐོང་བ་དག་ལས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་བཀོད་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་བཀོད་པ་རྣམས་མ་གཏོགས་པར་བཀོད་པ་དེ་དག་དང་། རྒྱན་དེ་དག་དང་། རྟགས་དེ་དག་དང་། མཚན་མ་དེ་དག་དང་། གནས་དེ་དག་དང་།
en: Bhagavat, when I am performing bodhisattva conduct may I see the array of qualities in the buddha realms of innumerable, uncountable hundreds of thousands of millions of trillions of buddhas, and may those adornments, signs, omens, places, wonders, and wishes be in my buddha realm, and may it have none of the array of qualities of śrāvakas or pratyekabuddhas or of buddha realms that have the five degeneracies. “ ‘

source: ངོ་མཚར་དེ་དག་དང་། སྨོན་ལམ་དེ་དག་ཐམས་ཅད་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ན་མཆིས་པར་གྱུར་ཅིག །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། ཡི་དགས་རྣམས་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there be no hell beings, animals, or pretas in that buddha realm.

source: རི་རབ་དང་། ཁོར་ཡུག་དང་། ཁོར་ཡུག་ཆེན་པོ་རྣམས་དང་། གོར་མ་དང་། རྡུལ་གྱི་རི་རྣམས་ཀྱང་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there be no Sumeru, Cakravāḍa, or Mahācakravāḍa mountains, no stones or dust.

source: རྒྱ་མཚོ་ཆེན་པོ་ཡང་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there be no great oceans.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ལྷའི་ལས་ཤིན་ཏུ་འདས་པའི་ཤིང་ལྗོན་པ་སྣ་ཚོགས་དག་དང་།
en: May that buddha realm be filled with various divine, wonderful trees, without any trees made of wood.

source: ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དག་གིས་ཀུན་ཏུ་གང་བར་གྱུར་པ་མ་གཏོགས་པར་ཤིང་ལས་གྲུབ་པའི་ལྗོན་པ་གཞན་དག་མ་མཆིས་པར་གྱུར་ཅིག །
en: May it be filled with divine coral tree flowers and great coral tree flowers.

source: དེ་ན་དྲི་ང་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there be no unpleasant smells there.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་སྤོས་རྒྱ་ཆེ་ཞིང་ཡངས་པ་སྣ་ཚོགས་དག་གིས་ཁྱབ་པར་གྱུར་ཅིག །
en: May that buddha realm be filled by a vast, extensive variety of incenses. “ ‘

source: དེར་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་ཤ་སྟག་འབྱུང་བར་གྱུར་ཅིག །
en: May all the bodhisattvas there be in their last life before buddhahood.

source: དེ་ན་སེམས་ཅན་གཅིག་ཀྱང་དེ་ནས་ཤི་འཕོས་ནས་དགའ་ལྡན་མ་གཏོགས་པར་གཞན་དུ་སྐྱེ་བར་མི་འགྱུར་ཞིང་།
en: May every being there when they pass away be reborn solely in Tuṣita paradises.

source: དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: When they pass away from there, may they attain the complete enlightenment of perfect buddhahood. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ཇི་སྲིད་དུ་སྐྱེས་བུ་ཆེན་པོའི་རྩལ་རྣམ་པ་དེ་ལྟ་བུ་དག་མངོན་པར་མ་བསྒྲུབས་པ་དེ་སྲིད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: Bhadanta Bhagavat, I will continue performing the conduct of a bodhisattva until I attain that power.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ལྟར་གཞག་པར་བགྱི་སྟེ།
en: I shall establish that kind of buddha realm.
